---Running--- 03-evaluate.py -----------
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 1000, 128)         1280000   
_________________________________________________________________
conv1d (Conv1D)              (None, 994, 32)           28704     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 198, 32)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 192, 32)           7200      
_________________________________________________________________
global_max_pooling1d (Global (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 3)                 99        
=================================================================
Total params: 1,316,003
Trainable params: 1,316,003
Non-trainable params: 0
_________________________________________________________________
None
