Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 1000, 128)         1280000   
_________________________________________________________________
conv1d (Conv1D)              (None, 994, 32)           28704     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 198, 32)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 192, 32)           7200      
_________________________________________________________________
global_max_pooling1d (Global (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 3)                 99        
=================================================================
Total params: 1,316,003
Trainable params: 1,316,003
Non-trainable params: 0
_________________________________________________________________

Model summary:  None
Applying model on test data, type:  UNIVERSE
X test shape:  (6478, 1000)
Y test shape:  (6478,)
  1/203 [..............................] - ETA: 4:38 - loss: 1.0262 - acc: 0.6875  6/203 [..............................] - ETA: 1s - loss: 1.0134 - acc: 0.7969   12/203 [>.............................] - ETA: 1s - loss: 1.0148 - acc: 0.7812 18/203 [=>............................] - ETA: 1s - loss: 1.0107 - acc: 0.8108 24/203 [==>...........................] - ETA: 1s - loss: 1.0115 - acc: 0.8112 30/203 [===>..........................] - ETA: 1s - loss: 1.0135 - acc: 0.7958 36/203 [====>.........................] - ETA: 1s - loss: 1.0125 - acc: 0.7995 42/203 [=====>........................] - ETA: 1s - loss: 1.0143 - acc: 0.7857 48/203 [======>.......................] - ETA: 1s - loss: 1.0173 - acc: 0.7604 54/203 [======>.......................] - ETA: 1s - loss: 1.0197 - acc: 0.7436 60/203 [=======>......................] - ETA: 1s - loss: 1.0205 - acc: 0.7391 66/203 [========>.....................] - ETA: 1s - loss: 1.0212 - acc: 0.7367 72/203 [=========>....................] - ETA: 1s - loss: 1.0242 - acc: 0.7192 77/203 [==========>...................] - ETA: 1s - loss: 1.0270 - acc: 0.7009 82/203 [===========>..................] - ETA: 1s - loss: 1.0287 - acc: 0.6925 88/203 [============>.................] - ETA: 1s - loss: 1.0302 - acc: 0.6882 94/203 [============>.................] - ETA: 1s - loss: 1.0314 - acc: 0.6875100/203 [=============>................] - ETA: 0s - loss: 1.0324 - acc: 0.6859106/203 [==============>...............] - ETA: 0s - loss: 1.0330 - acc: 0.6875112/203 [===============>..............] - ETA: 0s - loss: 1.0336 - acc: 0.6855117/203 [================>.............] - ETA: 0s - loss: 1.0341 - acc: 0.6830123/203 [=================>............] - ETA: 0s - loss: 1.0378 - acc: 0.6677129/203 [==================>...........] - ETA: 0s - loss: 1.0449 - acc: 0.6366135/203 [==================>...........] - ETA: 0s - loss: 1.0514 - acc: 0.6083141/203 [===================>..........] - ETA: 0s - loss: 1.0573 - acc: 0.5824147/203 [====================>.........] - ETA: 0s - loss: 1.0627 - acc: 0.5587153/203 [=====================>........] - ETA: 0s - loss: 1.0678 - acc: 0.5368159/203 [======================>.......] - ETA: 0s - loss: 1.0724 - acc: 0.5165165/203 [=======================>......] - ETA: 0s - loss: 1.0767 - acc: 0.4977171/203 [========================>.....] - ETA: 0s - loss: 1.0807 - acc: 0.4803177/203 [=========================>....] - ETA: 0s - loss: 1.0845 - acc: 0.4640183/203 [==========================>...] - ETA: 0s - loss: 1.0879 - acc: 0.4488189/203 [==========================>...] - ETA: 0s - loss: 1.0912 - acc: 0.4345195/203 [===========================>..] - ETA: 0s - loss: 1.0942 - acc: 0.4212201/203 [============================>.] - ETA: 0s - loss: 1.0971 - acc: 0.4086203/203 [==============================] - ETA: 0s - loss: 1.0978 - acc: 0.4057203/203 [==============================] - 3s 10ms/step - loss: 1.0978 - acc: 0.4057
TEST: [1.0978025197982788, 0.405680775642395]
