
Config:

Test:  UNIVERSE
Max length:  1000
Sentences per chunk:  4
Max words:  10000
Training split:  0.8

Hyper-parameters
Epochs:  1
Batch size:  128
Model:  CONV1D

Data:
X train shape:  (8861, 1000)
Y train shape:  (8861,)
X val shape:  (2216, 1000)
Y val shape:  (2216,)
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 1000, 128)         1280000   
_________________________________________________________________
conv1d (Conv1D)              (None, 994, 32)           28704     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 198, 32)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 192, 32)           7200      
_________________________________________________________________
global_max_pooling1d (Global (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 3)                 99        
=================================================================
Total params: 1,316,003
Trainable params: 1,316,003
Non-trainable params: 0
_________________________________________________________________
 1/70 [..............................] - ETA: 42:44 - loss: 1.0962 - acc: 0.3281 2/70 [..............................] - ETA: 6s - loss: 1.0982 - acc: 0.3242    3/70 [>.............................] - ETA: 5s - loss: 1.0979 - acc: 0.3351 4/70 [>.............................] - ETA: 5s - loss: 1.0971 - acc: 0.3441 5/70 [=>............................] - ETA: 5s - loss: 1.0960 - acc: 0.3543 6/70 [=>............................] - ETA: 4s - loss: 1.0952 - acc: 0.3604 7/70 [==>...........................] - ETA: 4s - loss: 1.0946 - acc: 0.3655 8/70 [==>...........................] - ETA: 4s - loss: 1.0941 - acc: 0.3700 9/70 [==>...........................] - ETA: 4s - loss: 1.0937 - acc: 0.372810/70 [===>..........................] - ETA: 4s - loss: 1.0935 - acc: 0.375011/70 [===>..........................] - ETA: 4s - loss: 1.0934 - acc: 0.376112/70 [====>.........................] - ETA: 4s - loss: 1.0933 - acc: 0.377313/70 [====>.........................] - ETA: 4s - loss: 1.0932 - acc: 0.378614/70 [=====>........................] - ETA: 4s - loss: 1.0931 - acc: 0.379515/70 [=====>........................] - ETA: 4s - loss: 1.0930 - acc: 0.380416/70 [=====>........................] - ETA: 4s - loss: 1.0928 - acc: 0.381417/70 [======>.......................] - ETA: 3s - loss: 1.0927 - acc: 0.382218/70 [======>.......................] - ETA: 3s - loss: 1.0926 - acc: 0.383019/70 [=======>......................] - ETA: 3s - loss: 1.0924 - acc: 0.383820/70 [=======>......................] - ETA: 3s - loss: 1.0923 - acc: 0.384321/70 [========>.....................] - ETA: 3s - loss: 1.0922 - acc: 0.384822/70 [========>.....................] - ETA: 3s - loss: 1.0922 - acc: 0.385123/70 [========>.....................] - ETA: 3s - loss: 1.0921 - acc: 0.385324/70 [=========>....................] - ETA: 3s - loss: 1.0920 - acc: 0.385525/70 [=========>....................] - ETA: 3s - loss: 1.0920 - acc: 0.385526/70 [==========>...................] - ETA: 3s - loss: 1.0919 - acc: 0.385627/70 [==========>...................] - ETA: 3s - loss: 1.0918 - acc: 0.385828/70 [===========>..................] - ETA: 3s - loss: 1.0917 - acc: 0.385829/70 [===========>..................] - ETA: 3s - loss: 1.0916 - acc: 0.385930/70 [===========>..................] - ETA: 2s - loss: 1.0915 - acc: 0.386131/70 [============>.................] - ETA: 2s - loss: 1.0914 - acc: 0.386332/70 [============>.................] - ETA: 2s - loss: 1.0914 - acc: 0.386433/70 [=============>................] - ETA: 2s - loss: 1.0913 - acc: 0.386634/70 [=============>................] - ETA: 2s - loss: 1.0912 - acc: 0.386735/70 [==============>...............] - ETA: 2s - loss: 1.0912 - acc: 0.386836/70 [==============>...............] - ETA: 2s - loss: 1.0911 - acc: 0.386937/70 [==============>...............] - ETA: 2s - loss: 1.0911 - acc: 0.387138/70 [===============>..............] - ETA: 2s - loss: 1.0910 - acc: 0.387239/70 [===============>..............] - ETA: 2s - loss: 1.0909 - acc: 0.387340/70 [================>.............] - ETA: 2s - loss: 1.0909 - acc: 0.387541/70 [================>.............] - ETA: 2s - loss: 1.0908 - acc: 0.387642/70 [=================>............] - ETA: 2s - loss: 1.0907 - acc: 0.387743/70 [=================>............] - ETA: 1s - loss: 1.0907 - acc: 0.387844/70 [=================>............] - ETA: 1s - loss: 1.0906 - acc: 0.388045/70 [==================>...........] - ETA: 1s - loss: 1.0905 - acc: 0.388146/70 [==================>...........] - ETA: 1s - loss: 1.0904 - acc: 0.388347/70 [===================>..........] - ETA: 1s - loss: 1.0903 - acc: 0.388548/70 [===================>..........] - ETA: 1s - loss: 1.0902 - acc: 0.388649/70 [====================>.........] - ETA: 1s - loss: 1.0902 - acc: 0.388850/70 [====================>.........] - ETA: 1s - loss: 1.0901 - acc: 0.388951/70 [====================>.........] - ETA: 1s - loss: 1.0900 - acc: 0.389052/70 [=====================>........] - ETA: 1s - loss: 1.0899 - acc: 0.389253/70 [=====================>........] - ETA: 1s - loss: 1.0898 - acc: 0.389454/70 [======================>.......] - ETA: 1s - loss: 1.0897 - acc: 0.389555/70 [======================>.......] - ETA: 1s - loss: 1.0896 - acc: 0.389756/70 [=======================>......] - ETA: 1s - loss: 1.0895 - acc: 0.389857/70 [=======================>......] - ETA: 0s - loss: 1.0895 - acc: 0.389958/70 [=======================>......] - ETA: 0s - loss: 1.0894 - acc: 0.390159/70 [========================>.....] - ETA: 0s - loss: 1.0893 - acc: 0.390260/70 [========================>.....] - ETA: 0s - loss: 1.0892 - acc: 0.390361/70 [=========================>....] - ETA: 0s - loss: 1.0891 - acc: 0.390362/70 [=========================>....] - ETA: 0s - loss: 1.0891 - acc: 0.390463/70 [==========================>...] - ETA: 0s - loss: 1.0890 - acc: 0.390564/70 [==========================>...] - ETA: 0s - loss: 1.0889 - acc: 0.390565/70 [==========================>...] - ETA: 0s - loss: 1.0889 - acc: 0.390666/70 [===========================>..] - ETA: 0s - loss: 1.0888 - acc: 0.390767/70 [===========================>..] - ETA: 0s - loss: 1.0888 - acc: 0.390768/70 [============================>.] - ETA: 0s - loss: 1.0887 - acc: 0.390869/70 [============================>.] - ETA: 0s - loss: 1.0886 - acc: 0.390970/70 [==============================] - ETA: 0s - loss: 1.0886 - acc: 0.390970/70 [==============================] - 44s 95ms/step - loss: 1.0885 - acc: 0.3910 - val_loss: 1.0800 - val_acc: 0.3854

Epoch 00001: val_acc improved from -inf to 0.38538, saving model to ./Models/CONV1D_max_val_acc.hdf5

 Saving training scores as:  ./Models/CONV1D_max_val_acc_training_scores.npy
