TF log level = 2

Config:

Test:  AUTHOR
Max length:  1000
Sentences per chunk:  4
Max words:  10000
Training split:  0.8

Hyper-parameters
Epochs:  40
Batch size:  128
Model:  CONV1D

Data:
X train shape:  (20120, 1000)
Y train shape:  (20120,)
X val shape:  (3772, 1000)
Y val shape:  (3772,)
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 1000, 128)         1280000   
_________________________________________________________________
conv1d (Conv1D)              (None, 994, 32)           28704     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 198, 32)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 192, 32)           7200      
_________________________________________________________________
global_max_pooling1d (Global (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 3)                 99        
=================================================================
Total params: 1,316,003
Trainable params: 1,316,003
Non-trainable params: 0
_________________________________________________________________
Epoch 1/40
  1/158 [..............................] - ETA: 1:59 - loss: 1.1210 - acc: 0.1484  2/158 [..............................] - ETA: 48s - loss: 1.1182 - acc: 0.1582   3/158 [..............................] - ETA: 47s - loss: 1.1156 - acc: 0.1645  4/158 [..............................] - ETA: 46s - loss: 1.1131 - acc: 0.1839  5/158 [..............................] - ETA: 46s - loss: 1.1107 - acc: 0.2131  6/158 [>.............................] - ETA: 46s - loss: 1.1085 - acc: 0.2418  7/158 [>.............................] - ETA: 45s - loss: 1.1064 - acc: 0.2694  8/158 [>.............................] - ETA: 45s - loss: 1.1044 - acc: 0.2942  9/158 [>.............................] - ETA: 45s - loss: 1.1024 - acc: 0.3168 10/158 [>.............................] - ETA: 45s - loss: 1.1006 - acc: 0.3364 11/158 [=>............................] - ETA: 46s - loss: 1.0989 - acc: 0.3539 12/158 [=>............................] - ETA: 45s - loss: 1.0971 - acc: 0.3701 13/158 [=>............................] - ETA: 44s - loss: 1.0953 - acc: 0.3851 14/158 [=>............................] - ETA: 44s - loss: 1.0936 - acc: 0.3986 15/158 [=>............................] - ETA: 44s - loss: 1.0920 - acc: 0.4108 16/158 [==>...........................] - ETA: 43s - loss: 1.0904 - acc: 0.4218 17/158 [==>...........................] - ETA: 43s - loss: 1.0889 - acc: 0.4317 18/158 [==>...........................] - ETA: 43s - loss: 1.0873 - acc: 0.4412 19/158 [==>...........................] - ETA: 42s - loss: 1.0859 - acc: 0.4498 20/158 [==>...........................] - ETA: 42s - loss: 1.0844 - acc: 0.4578 21/158 [==>...........................] - ETA: 42s - loss: 1.0830 - acc: 0.4652 22/158 [===>..........................] - ETA: 41s - loss: 1.0816 - acc: 0.4720