Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 1000, 128)         1280000   
_________________________________________________________________
conv1d (Conv1D)              (None, 994, 32)           28704     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 198, 32)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 192, 32)           7200      
_________________________________________________________________
global_max_pooling1d (Global (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 3)                 99        
=================================================================
Total params: 1,316,003
Trainable params: 1,316,003
Non-trainable params: 0
_________________________________________________________________

Model summary:  None
Applying model on test data, type:  UNIVERSE
X train shape:  (8861, 1000)
Y train shape:  (8861,)
X val shape:  (2216, 1000)
Y val shape:  (2216,)
X test shape:  (6478, 1000)
Y test shape:  (6478,)
 1/70 [..............................] - ETA: 2:10 - loss: 0.0061 - acc: 1.0000 3/70 [>.............................] - ETA: 2s - loss: 0.0023 - acc: 1.0000   5/70 [=>............................] - ETA: 1s - loss: 0.0054 - acc: 0.9984 7/70 [==>...........................] - ETA: 1s - loss: 0.0043 - acc: 0.9989 9/70 [==>...........................] - ETA: 1s - loss: 0.0038 - acc: 0.999111/70 [===>..........................] - ETA: 1s - loss: 0.0038 - acc: 0.999313/70 [====>.........................] - ETA: 1s - loss: 0.0033 - acc: 0.999415/70 [=====>........................] - ETA: 1s - loss: 0.0034 - acc: 0.999517/70 [======>.......................] - ETA: 1s - loss: 0.0031 - acc: 0.999519/70 [=======>......................] - ETA: 1s - loss: 0.0036 - acc: 0.999221/70 [========>.....................] - ETA: 1s - loss: 0.0033 - acc: 0.999323/70 [========>.....................] - ETA: 1s - loss: 0.0034 - acc: 0.999025/70 [=========>....................] - ETA: 1s - loss: 0.0032 - acc: 0.999127/70 [==========>...................] - ETA: 1s - loss: 0.0033 - acc: 0.999129/70 [===========>..................] - ETA: 1s - loss: 0.0032 - acc: 0.999231/70 [============>.................] - ETA: 1s - loss: 0.0032 - acc: 0.999233/70 [=============>................] - ETA: 1s - loss: 0.0034 - acc: 0.999335/70 [==============>...............] - ETA: 1s - loss: 0.0036 - acc: 0.999137/70 [==============>...............] - ETA: 0s - loss: 0.0034 - acc: 0.999239/70 [===============>..............] - ETA: 0s - loss: 0.0034 - acc: 0.999241/70 [================>.............] - ETA: 0s - loss: 0.0036 - acc: 0.999043/70 [=================>............] - ETA: 0s - loss: 0.0038 - acc: 0.998945/70 [==================>...........] - ETA: 0s - loss: 0.0037 - acc: 0.999047/70 [===================>..........] - ETA: 0s - loss: 0.0037 - acc: 0.999049/70 [====================>.........] - ETA: 0s - loss: 0.0037 - acc: 0.999051/70 [====================>.........] - ETA: 0s - loss: 0.0037 - acc: 0.999153/70 [=====================>........] - ETA: 0s - loss: 0.0040 - acc: 0.998855/70 [======================>.......] - ETA: 0s - loss: 0.0041 - acc: 0.998957/70 [=======================>......] - ETA: 0s - loss: 0.0043 - acc: 0.998859/70 [========================>.....] - ETA: 0s - loss: 0.0043 - acc: 0.998861/70 [=========================>....] - ETA: 0s - loss: 0.0042 - acc: 0.998863/70 [==========================>...] - ETA: 0s - loss: 0.0043 - acc: 0.998865/70 [==========================>...] - ETA: 0s - loss: 0.0042 - acc: 0.998867/70 [===========================>..] - ETA: 0s - loss: 0.0041 - acc: 0.998869/70 [============================>.] - ETA: 0s - loss: 0.0042 - acc: 0.998870/70 [==============================] - ETA: 0s - loss: 0.0042 - acc: 0.998870/70 [==============================] - 4s 31ms/step - loss: 0.0042 - acc: 0.9988
 1/18 [>.............................] - ETA: 0s - loss: 0.1914 - acc: 0.9453 3/18 [====>.........................] - ETA: 0s - loss: 0.1991 - acc: 0.9401 5/18 [=======>......................] - ETA: 0s - loss: 0.2247 - acc: 0.9297 7/18 [==========>...................] - ETA: 0s - loss: 0.2289 - acc: 0.9330 9/18 [==============>...............] - ETA: 0s - loss: 0.2121 - acc: 0.937511/18 [=================>............] - ETA: 0s - loss: 0.2177 - acc: 0.936813/18 [====================>.........] - ETA: 0s - loss: 0.2170 - acc: 0.937515/18 [========================>.....] - ETA: 0s - loss: 0.2154 - acc: 0.937017/18 [===========================>..] - ETA: 0s - loss: 0.2158 - acc: 0.936618/18 [==============================] - ETA: 0s - loss: 0.2142 - acc: 0.936818/18 [==============================] - 1s 39ms/step - loss: 0.2142 - acc: 0.9368
 1/51 [..............................] - ETA: 2s - loss: 0.7651 - acc: 0.8281 3/51 [>.............................] - ETA: 1s - loss: 0.8686 - acc: 0.7682 5/51 [=>............................] - ETA: 1s - loss: 0.8947 - acc: 0.7766 7/51 [===>..........................] - ETA: 1s - loss: 0.9301 - acc: 0.7723 9/51 [====>.........................] - ETA: 1s - loss: 1.0390 - acc: 0.748311/51 [=====>........................] - ETA: 1s - loss: 0.9907 - acc: 0.764913/51 [======>.......................] - ETA: 1s - loss: 1.0275 - acc: 0.758415/51 [=======>......................] - ETA: 1s - loss: 1.0433 - acc: 0.755217/51 [=========>....................] - ETA: 0s - loss: 1.0335 - acc: 0.752819/51 [==========>...................] - ETA: 0s - loss: 1.0046 - acc: 0.759921/51 [===========>..................] - ETA: 0s - loss: 0.9669 - acc: 0.764923/51 [============>.................] - ETA: 0s - loss: 0.9368 - acc: 0.769025/51 [=============>................] - ETA: 0s - loss: 0.9218 - acc: 0.770627/51 [==============>...............] - ETA: 0s - loss: 0.8926 - acc: 0.775829/51 [================>.............] - ETA: 0s - loss: 0.8565 - acc: 0.781831/51 [=================>............] - ETA: 0s - loss: 0.8354 - acc: 0.787333/51 [==================>...........] - ETA: 0s - loss: 0.8629 - acc: 0.780335/51 [===================>..........] - ETA: 0s - loss: 0.8615 - acc: 0.780137/51 [====================>.........] - ETA: 0s - loss: 0.8819 - acc: 0.775539/51 [=====================>........] - ETA: 0s - loss: 0.8840 - acc: 0.775441/51 [=======================>......] - ETA: 0s - loss: 0.8833 - acc: 0.774843/51 [========================>.....] - ETA: 0s - loss: 0.9141 - acc: 0.770745/51 [=========================>....] - ETA: 0s - loss: 0.9406 - acc: 0.766847/51 [==========================>...] - ETA: 0s - loss: 0.9717 - acc: 0.763349/51 [===========================>..] - ETA: 0s - loss: 0.9886 - acc: 0.761851/51 [==============================] - ETA: 0s - loss: 0.9968 - acc: 0.760951/51 [==============================] - 2s 36ms/step - loss: 0.9968 - acc: 0.7609
MODEL PERFORMANCE

 Training accuracy:  0.9987586140632629 Training loss:  0.004153389949351549

 Validation accuracy:  0.9368231296539307 Vlidation loss:  0.2142033576965332

 Test accuracy:  0.9967923760414124 Test loss:  0.7608829736709595
