Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, None, 128)         1280000   
_________________________________________________________________
lstm (LSTM)                  (None, 128)               131584    
_________________________________________________________________
dense (Dense)                (None, 3)                 387       
=================================================================
Total params: 1,411,971
Trainable params: 1,411,971
Non-trainable params: 0
_________________________________________________________________

Model summary:  None
Applying model on test data, type:  AUTHOR
X train shape:  (8861, 1000)
Y train shape:  (8861,)
X val shape:  (2216, 1000)
Y val shape:  (2216,)
X test shape:  (2495, 1000)
Y test shape:  (2495,)
 1/70 [..............................] - ETA: 1:33 - loss: 0.0026 - acc: 1.0000 2/70 [..............................] - ETA: 5s - loss: 0.0014 - acc: 1.0000   3/70 [>.............................] - ETA: 5s - loss: 9.8274e-04 - acc: 1.0000 4/70 [>.............................] - ETA: 5s - loss: 0.0035 - acc: 0.9980     5/70 [=>............................] - ETA: 5s - loss: 0.0067 - acc: 0.9969 6/70 [=>............................] - ETA: 5s - loss: 0.0057 - acc: 0.9974 7/70 [==>...........................] - ETA: 5s - loss: 0.0050 - acc: 0.9978 8/70 [==>...........................] - ETA: 5s - loss: 0.0047 - acc: 0.9980 9/70 [==>...........................] - ETA: 5s - loss: 0.0042 - acc: 0.998310/70 [===>..........................] - ETA: 5s - loss: 0.0042 - acc: 0.998411/70 [===>..........................] - ETA: 5s - loss: 0.0039 - acc: 0.998612/70 [====>.........................] - ETA: 5s - loss: 0.0036 - acc: 0.998713/70 [====>.........................] - ETA: 5s - loss: 0.0033 - acc: 0.998814/70 [=====>........................] - ETA: 5s - loss: 0.0031 - acc: 0.998915/70 [=====>........................] - ETA: 5s - loss: 0.0031 - acc: 0.999016/70 [=====>........................] - ETA: 5s - loss: 0.0030 - acc: 0.999017/70 [======>.......................] - ETA: 4s - loss: 0.0029 - acc: 0.999118/70 [======>.......................] - ETA: 4s - loss: 0.0028 - acc: 0.999119/70 [=======>......................] - ETA: 4s - loss: 0.0030 - acc: 0.999220/70 [=======>......................] - ETA: 4s - loss: 0.0029 - acc: 0.999221/70 [========>.....................] - ETA: 4s - loss: 0.0027 - acc: 0.999322/70 [========>.....................] - ETA: 4s - loss: 0.0026 - acc: 0.999323/70 [========>.....................] - ETA: 4s - loss: 0.0026 - acc: 0.999324/70 [=========>....................] - ETA: 4s - loss: 0.0025 - acc: 0.999325/70 [=========>....................] - ETA: 4s - loss: 0.0024 - acc: 0.999426/70 [==========>...................] - ETA: 4s - loss: 0.0024 - acc: 0.999427/70 [==========>...................] - ETA: 3s - loss: 0.0023 - acc: 0.999428/70 [===========>..................] - ETA: 3s - loss: 0.0022 - acc: 0.999429/70 [===========>..................] - ETA: 3s - loss: 0.0023 - acc: 0.999530/70 [===========>..................] - ETA: 3s - loss: 0.0023 - acc: 0.999531/70 [============>.................] - ETA: 3s - loss: 0.0022 - acc: 0.999532/70 [============>.................] - ETA: 3s - loss: 0.0023 - acc: 0.999533/70 [=============>................] - ETA: 3s - loss: 0.0024 - acc: 0.999334/70 [=============>................] - ETA: 3s - loss: 0.0024 - acc: 0.999335/70 [==============>...............] - ETA: 3s - loss: 0.0024 - acc: 0.999336/70 [==============>...............] - ETA: 3s - loss: 0.0024 - acc: 0.999337/70 [==============>...............] - ETA: 3s - loss: 0.0023 - acc: 0.999438/70 [===============>..............] - ETA: 2s - loss: 0.0022 - acc: 0.999439/70 [===============>..............] - ETA: 2s - loss: 0.0023 - acc: 0.999440/70 [================>.............] - ETA: 2s - loss: 0.0025 - acc: 0.999241/70 [================>.............] - ETA: 2s - loss: 0.0025 - acc: 0.999242/70 [=================>............] - ETA: 2s - loss: 0.0025 - acc: 0.999343/70 [=================>............] - ETA: 2s - loss: 0.0027 - acc: 0.999144/70 [=================>............] - ETA: 2s - loss: 0.0027 - acc: 0.999145/70 [==================>...........] - ETA: 2s - loss: 0.0029 - acc: 0.999046/70 [==================>...........] - ETA: 2s - loss: 0.0028 - acc: 0.999047/70 [===================>..........] - ETA: 2s - loss: 0.0028 - acc: 0.999048/70 [===================>..........] - ETA: 2s - loss: 0.0028 - acc: 0.999049/70 [====================>.........] - ETA: 1s - loss: 0.0027 - acc: 0.999050/70 [====================>.........] - ETA: 1s - loss: 0.0027 - acc: 0.999151/70 [====================>.........] - ETA: 1s - loss: 0.0027 - acc: 0.999152/70 [=====================>........] - ETA: 1s - loss: 0.0027 - acc: 0.999153/70 [=====================>........] - ETA: 1s - loss: 0.0027 - acc: 0.999154/70 [======================>.......] - ETA: 1s - loss: 0.0028 - acc: 0.999155/70 [======================>.......] - ETA: 1s - loss: 0.0029 - acc: 0.999056/70 [=======================>......] - ETA: 1s - loss: 0.0029 - acc: 0.999057/70 [=======================>......] - ETA: 1s - loss: 0.0029 - acc: 0.999058/70 [=======================>......] - ETA: 1s - loss: 0.0029 - acc: 0.999159/70 [========================>.....] - ETA: 1s - loss: 0.0029 - acc: 0.999160/70 [========================>.....] - ETA: 0s - loss: 0.0028 - acc: 0.999161/70 [=========================>....] - ETA: 0s - loss: 0.0028 - acc: 0.999162/70 [=========================>....] - ETA: 0s - loss: 0.0028 - acc: 0.999163/70 [==========================>...] - ETA: 0s - loss: 0.0028 - acc: 0.999164/70 [==========================>...] - ETA: 0s - loss: 0.0028 - acc: 0.999165/70 [==========================>...] - ETA: 0s - loss: 0.0027 - acc: 0.999266/70 [===========================>..] - ETA: 0s - loss: 0.0027 - acc: 0.999267/70 [===========================>..] - ETA: 0s - loss: 0.0027 - acc: 0.999268/70 [============================>.] - ETA: 0s - loss: 0.0027 - acc: 0.999269/70 [============================>.] - ETA: 0s - loss: 0.0030 - acc: 0.999070/70 [==============================] - 8s 91ms/step - loss: 0.0029 - acc: 0.9990
 1/18 [>.............................] - ETA: 1s - loss: 0.3800 - acc: 0.9297 2/18 [==>...........................] - ETA: 1s - loss: 0.3686 - acc: 0.9336 3/18 [====>.........................] - ETA: 1s - loss: 0.4757 - acc: 0.9193 4/18 [=====>........................] - ETA: 1s - loss: 0.4272 - acc: 0.9238 5/18 [=======>......................] - ETA: 1s - loss: 0.4105 - acc: 0.9219 6/18 [=========>....................] - ETA: 1s - loss: 0.4014 - acc: 0.9219 7/18 [==========>...................] - ETA: 0s - loss: 0.3782 - acc: 0.9263 8/18 [============>.................] - ETA: 0s - loss: 0.3497 - acc: 0.9297 9/18 [==============>...............] - ETA: 0s - loss: 0.3679 - acc: 0.928010/18 [===============>..............] - ETA: 0s - loss: 0.3701 - acc: 0.925811/18 [=================>............] - ETA: 0s - loss: 0.3769 - acc: 0.922612/18 [===================>..........] - ETA: 0s - loss: 0.3614 - acc: 0.925113/18 [====================>.........] - ETA: 0s - loss: 0.3559 - acc: 0.925514/18 [======================>.......] - ETA: 0s - loss: 0.3488 - acc: 0.926315/18 [========================>.....] - ETA: 0s - loss: 0.3513 - acc: 0.926016/18 [=========================>....] - ETA: 0s - loss: 0.3351 - acc: 0.929217/18 [===========================>..] - ETA: 0s - loss: 0.3230 - acc: 0.930618/18 [==============================] - ETA: 0s - loss: 0.3256 - acc: 0.930118/18 [==============================] - 2s 90ms/step - loss: 0.3256 - acc: 0.9301
 1/20 [>.............................] - ETA: 1s - loss: 0.6294 - acc: 0.8438 2/20 [==>...........................] - ETA: 1s - loss: 0.5234 - acc: 0.8789 3/20 [===>..........................] - ETA: 1s - loss: 0.7488 - acc: 0.8255 4/20 [=====>........................] - ETA: 1s - loss: 0.8643 - acc: 0.8066 5/20 [======>.......................] - ETA: 1s - loss: 0.8595 - acc: 0.8141 6/20 [========>.....................] - ETA: 1s - loss: 0.9708 - acc: 0.7982 7/20 [=========>....................] - ETA: 1s - loss: 1.0231 - acc: 0.7857 8/20 [===========>..................] - ETA: 1s - loss: 1.0094 - acc: 0.7891 9/20 [============>.................] - ETA: 0s - loss: 1.0323 - acc: 0.786510/20 [==============>...............] - ETA: 0s - loss: 1.0291 - acc: 0.791411/20 [===============>..............] - ETA: 0s - loss: 1.1274 - acc: 0.772012/20 [=================>............] - ETA: 0s - loss: 1.1658 - acc: 0.752013/20 [==================>...........] - ETA: 0s - loss: 1.1883 - acc: 0.741014/20 [====================>.........] - ETA: 0s - loss: 1.1635 - acc: 0.742715/20 [=====================>........] - ETA: 0s - loss: 1.1401 - acc: 0.746916/20 [=======================>......] - ETA: 0s - loss: 1.1309 - acc: 0.748017/20 [========================>.....] - ETA: 0s - loss: 1.1237 - acc: 0.749518/20 [==========================>...] - ETA: 0s - loss: 1.1363 - acc: 0.743519/20 [===========================>..] - ETA: 0s - loss: 1.1374 - acc: 0.743820/20 [==============================] - ETA: 0s - loss: 1.1544 - acc: 0.740720/20 [==============================] - 2s 92ms/step - loss: 1.1544 - acc: 0.7407
MODEL PERFORMANCE

 Training accuracy:  0.9989843368530273 Training loss:  0.0029464338440448046

 Validation accuracy:  0.9300541281700134 Vlidation loss:  0.3255615532398224

 Test accuracy:  1.1544220447540283 Test loss:  0.7406813502311707
