Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 1000, 128)         1280000   
_________________________________________________________________
conv1d (Conv1D)              (None, 994, 32)           28704     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 198, 32)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 192, 32)           7200      
_________________________________________________________________
global_max_pooling1d (Global (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 3)                 99        
=================================================================
Total params: 1,316,003
Trainable params: 1,316,003
Non-trainable params: 0
_________________________________________________________________

Model summary:  None
Applying model on test data, type:  UNIVERSE
X train shape:  (8861, 1000)
Y train shape:  (8861,)
X val shape:  (2216, 1000)
Y val shape:  (2216,)
X test shape:  (6478, 1000)
Y test shape:  (6478,)
 1/70 [..............................] - ETA: 2:06 - loss: 0.0049 - acc: 1.0000 3/70 [>.............................] - ETA: 2s - loss: 0.0022 - acc: 1.0000   5/70 [=>............................] - ETA: 1s - loss: 0.0064 - acc: 0.9969 7/70 [==>...........................] - ETA: 1s - loss: 0.0051 - acc: 0.9978 9/70 [==>...........................] - ETA: 1s - loss: 0.0045 - acc: 0.998311/70 [===>..........................] - ETA: 1s - loss: 0.0045 - acc: 0.998613/70 [====>.........................] - ETA: 1s - loss: 0.0039 - acc: 0.998815/70 [=====>........................] - ETA: 1s - loss: 0.0047 - acc: 0.998417/70 [======>.......................] - ETA: 1s - loss: 0.0043 - acc: 0.998619/70 [=======>......................] - ETA: 1s - loss: 0.0051 - acc: 0.997921/70 [========>.....................] - ETA: 1s - loss: 0.0047 - acc: 0.998123/70 [========>.....................] - ETA: 1s - loss: 0.0049 - acc: 0.998025/70 [=========>....................] - ETA: 1s - loss: 0.0046 - acc: 0.998127/70 [==========>...................] - ETA: 1s - loss: 0.0048 - acc: 0.998029/70 [===========>..................] - ETA: 1s - loss: 0.0046 - acc: 0.998131/70 [============>.................] - ETA: 1s - loss: 0.0045 - acc: 0.998233/70 [=============>................] - ETA: 1s - loss: 0.0048 - acc: 0.998135/70 [==============>...............] - ETA: 1s - loss: 0.0049 - acc: 0.998237/70 [==============>...............] - ETA: 0s - loss: 0.0047 - acc: 0.998339/70 [===============>..............] - ETA: 0s - loss: 0.0047 - acc: 0.998241/70 [================>.............] - ETA: 0s - loss: 0.0048 - acc: 0.998343/70 [=================>............] - ETA: 0s - loss: 0.0050 - acc: 0.998245/70 [==================>...........] - ETA: 0s - loss: 0.0049 - acc: 0.998347/70 [===================>..........] - ETA: 0s - loss: 0.0049 - acc: 0.998249/70 [====================>.........] - ETA: 0s - loss: 0.0049 - acc: 0.998251/70 [====================>.........] - ETA: 0s - loss: 0.0049 - acc: 0.998253/70 [=====================>........] - ETA: 0s - loss: 0.0051 - acc: 0.998155/70 [======================>.......] - ETA: 0s - loss: 0.0056 - acc: 0.997957/70 [=======================>......] - ETA: 0s - loss: 0.0057 - acc: 0.997959/70 [========================>.....] - ETA: 0s - loss: 0.0057 - acc: 0.998061/70 [=========================>....] - ETA: 0s - loss: 0.0056 - acc: 0.998163/70 [==========================>...] - ETA: 0s - loss: 0.0057 - acc: 0.998165/70 [==========================>...] - ETA: 0s - loss: 0.0055 - acc: 0.998267/70 [===========================>..] - ETA: 0s - loss: 0.0055 - acc: 0.998169/70 [============================>.] - ETA: 0s - loss: 0.0055 - acc: 0.998270/70 [==============================] - ETA: 0s - loss: 0.0055 - acc: 0.998270/70 [==============================] - 4s 31ms/step - loss: 0.0055 - acc: 0.9982
 1/18 [>.............................] - ETA: 0s - loss: 0.1711 - acc: 0.9453 3/18 [====>.........................] - ETA: 0s - loss: 0.1987 - acc: 0.9323 5/18 [=======>......................] - ETA: 0s - loss: 0.2111 - acc: 0.9281 7/18 [==========>...................] - ETA: 0s - loss: 0.2085 - acc: 0.9330 9/18 [==============>...............] - ETA: 0s - loss: 0.1942 - acc: 0.940111/18 [=================>............] - ETA: 0s - loss: 0.1995 - acc: 0.941113/18 [====================>.........] - ETA: 0s - loss: 0.2033 - acc: 0.938715/18 [========================>.....] - ETA: 0s - loss: 0.1968 - acc: 0.937517/18 [===========================>..] - ETA: 0s - loss: 0.1997 - acc: 0.935218/18 [==============================] - ETA: 0s - loss: 0.1972 - acc: 0.935918/18 [==============================] - 1s 39ms/step - loss: 0.1972 - acc: 0.9359
 1/51 [..............................] - ETA: 2s - loss: 0.6113 - acc: 0.8672 3/51 [>.............................] - ETA: 1s - loss: 0.6982 - acc: 0.8125 5/51 [=>............................] - ETA: 1s - loss: 0.7072 - acc: 0.8250 7/51 [===>..........................] - ETA: 1s - loss: 0.7314 - acc: 0.8158 9/51 [====>.........................] - ETA: 1s - loss: 0.8222 - acc: 0.790811/51 [=====>........................] - ETA: 1s - loss: 0.7900 - acc: 0.795513/51 [======>.......................] - ETA: 1s - loss: 0.8415 - acc: 0.787315/51 [=======>......................] - ETA: 1s - loss: 0.8472 - acc: 0.782817/51 [=========>....................] - ETA: 0s - loss: 0.8400 - acc: 0.779019/51 [==========>...................] - ETA: 0s - loss: 0.8227 - acc: 0.782521/51 [===========>..................] - ETA: 0s - loss: 0.7980 - acc: 0.786123/51 [============>.................] - ETA: 0s - loss: 0.7775 - acc: 0.789125/51 [=============>................] - ETA: 0s - loss: 0.7693 - acc: 0.789727/51 [==============>...............] - ETA: 0s - loss: 0.7483 - acc: 0.792829/51 [================>.............] - ETA: 0s - loss: 0.7157 - acc: 0.800131/51 [=================>............] - ETA: 0s - loss: 0.7017 - acc: 0.803933/51 [==================>...........] - ETA: 0s - loss: 0.7357 - acc: 0.794535/51 [===================>..........] - ETA: 0s - loss: 0.7427 - acc: 0.791537/51 [====================>.........] - ETA: 0s - loss: 0.7667 - acc: 0.784039/51 [=====================>........] - ETA: 0s - loss: 0.7740 - acc: 0.782141/51 [=======================>......] - ETA: 0s - loss: 0.7835 - acc: 0.780143/51 [========================>.....] - ETA: 0s - loss: 0.8161 - acc: 0.774545/51 [=========================>....] - ETA: 0s - loss: 0.8487 - acc: 0.769647/51 [==========================>...] - ETA: 0s - loss: 0.8838 - acc: 0.764549/51 [===========================>..] - ETA: 0s - loss: 0.9015 - acc: 0.762051/51 [==============================] - ETA: 0s - loss: 0.9099 - acc: 0.761251/51 [==============================] - 2s 35ms/step - loss: 0.9099 - acc: 0.7612
MODEL PERFORMANCE

 Training accuracy:  0.9981943368911743 Training loss:  0.005496229510754347

 Validation accuracy:  0.9359205961227417 Vlidation loss:  0.1971544474363327

 Test accuracy:  0.9098964929580688 Test loss:  0.761191725730896
