Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 1000, 128)         1280000   
_________________________________________________________________
conv1d (Conv1D)              (None, 994, 32)           28704     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 198, 32)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 192, 32)           7200      
_________________________________________________________________
global_max_pooling1d (Global (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 3)                 99        
=================================================================
Total params: 1,316,003
Trainable params: 1,316,003
Non-trainable params: 0
_________________________________________________________________

Model summary:  None
Applying model on test data, type:  AUTHOR
X train shape:  (8861, 1000)
Y train shape:  (8861,)
X val shape:  (2216, 1000)
Y val shape:  (2216,)
X test shape:  (2495, 1000)
Y test shape:  (2495,)
 1/70 [..............................] - ETA: 1:44 - loss: 0.0099 - acc: 0.9922 3/70 [>.............................] - ETA: 1s - loss: 0.0048 - acc: 0.9974   5/70 [=>............................] - ETA: 1s - loss: 0.0082 - acc: 0.9969 7/70 [==>...........................] - ETA: 1s - loss: 0.0071 - acc: 0.9978 9/70 [==>...........................] - ETA: 1s - loss: 0.0070 - acc: 0.997411/70 [===>..........................] - ETA: 1s - loss: 0.0078 - acc: 0.997213/70 [====>.........................] - ETA: 1s - loss: 0.0068 - acc: 0.997615/70 [=====>........................] - ETA: 1s - loss: 0.0072 - acc: 0.997417/70 [======>.......................] - ETA: 1s - loss: 0.0069 - acc: 0.997719/70 [=======>......................] - ETA: 1s - loss: 0.0074 - acc: 0.997521/70 [========>.....................] - ETA: 1s - loss: 0.0069 - acc: 0.997823/70 [========>.....................] - ETA: 1s - loss: 0.0068 - acc: 0.998025/70 [=========>....................] - ETA: 1s - loss: 0.0066 - acc: 0.998127/70 [==========>...................] - ETA: 1s - loss: 0.0066 - acc: 0.998329/70 [===========>..................] - ETA: 1s - loss: 0.0065 - acc: 0.998431/70 [============>.................] - ETA: 1s - loss: 0.0064 - acc: 0.998533/70 [=============>................] - ETA: 1s - loss: 0.0070 - acc: 0.998135/70 [==============>...............] - ETA: 0s - loss: 0.0072 - acc: 0.998037/70 [==============>...............] - ETA: 0s - loss: 0.0069 - acc: 0.998139/70 [===============>..............] - ETA: 0s - loss: 0.0069 - acc: 0.998241/70 [================>.............] - ETA: 0s - loss: 0.0075 - acc: 0.998143/70 [=================>............] - ETA: 0s - loss: 0.0077 - acc: 0.998045/70 [==================>...........] - ETA: 0s - loss: 0.0075 - acc: 0.998147/70 [===================>..........] - ETA: 0s - loss: 0.0075 - acc: 0.998249/70 [====================>.........] - ETA: 0s - loss: 0.0075 - acc: 0.998251/70 [====================>.........] - ETA: 0s - loss: 0.0075 - acc: 0.998353/70 [=====================>........] - ETA: 0s - loss: 0.0079 - acc: 0.997955/70 [======================>.......] - ETA: 0s - loss: 0.0082 - acc: 0.997757/70 [=======================>......] - ETA: 0s - loss: 0.0084 - acc: 0.997759/70 [========================>.....] - ETA: 0s - loss: 0.0085 - acc: 0.997661/70 [=========================>....] - ETA: 0s - loss: 0.0083 - acc: 0.997763/70 [==========================>...] - ETA: 0s - loss: 0.0084 - acc: 0.997665/70 [==========================>...] - ETA: 0s - loss: 0.0082 - acc: 0.997767/70 [===========================>..] - ETA: 0s - loss: 0.0081 - acc: 0.997869/70 [============================>.] - ETA: 0s - loss: 0.0081 - acc: 0.997770/70 [==============================] - ETA: 0s - loss: 0.0081 - acc: 0.997770/70 [==============================] - 4s 29ms/step - loss: 0.0081 - acc: 0.9977
 1/18 [>.............................] - ETA: 0s - loss: 0.1712 - acc: 0.9453 3/18 [====>.........................] - ETA: 0s - loss: 0.1851 - acc: 0.9323 5/18 [=======>......................] - ETA: 0s - loss: 0.1923 - acc: 0.9250 7/18 [==========>...................] - ETA: 0s - loss: 0.1862 - acc: 0.9364 9/18 [==============>...............] - ETA: 0s - loss: 0.1700 - acc: 0.941811/18 [=================>............] - ETA: 0s - loss: 0.1719 - acc: 0.942513/18 [====================>.........] - ETA: 0s - loss: 0.1791 - acc: 0.940515/18 [========================>.....] - ETA: 0s - loss: 0.1823 - acc: 0.939617/18 [===========================>..] - ETA: 0s - loss: 0.1805 - acc: 0.939818/18 [==============================] - ETA: 0s - loss: 0.1802 - acc: 0.940018/18 [==============================] - 1s 36ms/step - loss: 0.1802 - acc: 0.9400
 1/20 [>.............................] - ETA: 0s - loss: 0.3503 - acc: 0.8594 3/20 [===>..........................] - ETA: 0s - loss: 0.3955 - acc: 0.8568 5/20 [======>.......................] - ETA: 0s - loss: 0.4318 - acc: 0.8516 7/20 [=========>....................] - ETA: 0s - loss: 0.4804 - acc: 0.8471 9/20 [============>.................] - ETA: 0s - loss: 0.4940 - acc: 0.844611/20 [===============>..............] - ETA: 0s - loss: 0.5274 - acc: 0.837413/20 [==================>...........] - ETA: 0s - loss: 0.6277 - acc: 0.807715/20 [=====================>........] - ETA: 0s - loss: 0.6153 - acc: 0.805717/20 [========================>.....] - ETA: 0s - loss: 0.6056 - acc: 0.810219/20 [===========================>..] - ETA: 0s - loss: 0.6162 - acc: 0.803520/20 [==============================] - ETA: 0s - loss: 0.6275 - acc: 0.800820/20 [==============================] - 1s 38ms/step - loss: 0.6275 - acc: 0.8008
MODEL PERFORMANCE

 Training accuracy:  0.9977428913116455 Training loss:  0.008061230182647705

 Validation accuracy:  0.9399819374084473 Vlidation loss:  0.18019595742225647

 Test accuracy:  0.6274755001068115 Test loss:  0.8008015751838684
