Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 1000, 128)         1280000   
_________________________________________________________________
conv1d (Conv1D)              (None, 994, 32)           28704     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 198, 32)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 192, 32)           7200      
_________________________________________________________________
global_max_pooling1d (Global (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 3)                 99        
=================================================================
Total params: 1,316,003
Trainable params: 1,316,003
Non-trainable params: 0
_________________________________________________________________

Model summary:  None
Applying model on test data, type:  UNIVERSE
X test shape:  (6478, 1000)
Y test shape:  (6478,)
  1/203 [..............................] - ETA: 4:15 - loss: 0.9375 - acc: 1.0000  7/203 [>.............................] - ETA: 1s - loss: 0.9308 - acc: 1.0000   14/203 [=>............................] - ETA: 1s - loss: 0.9309 - acc: 1.0000 21/203 [==>...........................] - ETA: 1s - loss: 0.9303 - acc: 1.0000 28/203 [===>..........................] - ETA: 1s - loss: 0.9306 - acc: 1.0000 35/203 [====>.........................] - ETA: 1s - loss: 0.9303 - acc: 1.0000 42/203 [=====>........................] - ETA: 1s - loss: 0.9317 - acc: 1.0000 49/203 [======>.......................] - ETA: 1s - loss: 0.9342 - acc: 1.0000 56/203 [=======>......................] - ETA: 1s - loss: 0.9358 - acc: 1.0000 63/203 [========>.....................] - ETA: 1s - loss: 0.9367 - acc: 1.0000 70/203 [=========>....................] - ETA: 1s - loss: 0.9430 - acc: 0.9643 77/203 [==========>...................] - ETA: 1s - loss: 0.9579 - acc: 0.8766 84/203 [===========>..................] - ETA: 0s - loss: 0.9690 - acc: 0.8036 91/203 [============>.................] - ETA: 0s - loss: 0.9787 - acc: 0.7418 98/203 [=============>................] - ETA: 0s - loss: 0.9863 - acc: 0.6888104/203 [==============>...............] - ETA: 0s - loss: 0.9917 - acc: 0.6490110/203 [===============>..............] - ETA: 0s - loss: 0.9968 - acc: 0.6136117/203 [================>.............] - ETA: 0s - loss: 1.0021 - acc: 0.5769123/203 [=================>............] - ETA: 0s - loss: 1.0097 - acc: 0.5490130/203 [==================>...........] - ETA: 0s - loss: 1.0227 - acc: 0.5195136/203 [===================>..........] - ETA: 0s - loss: 1.0328 - acc: 0.4966142/203 [===================>..........] - ETA: 0s - loss: 1.0420 - acc: 0.4756148/203 [====================>.........] - ETA: 0s - loss: 1.0503 - acc: 0.4563154/203 [=====================>........] - ETA: 0s - loss: 1.0581 - acc: 0.4385160/203 [======================>.......] - ETA: 0s - loss: 1.0651 - acc: 0.4221166/203 [=======================>......] - ETA: 0s - loss: 1.0719 - acc: 0.4068172/203 [========================>.....] - ETA: 0s - loss: 1.0782 - acc: 0.3926178/203 [=========================>....] - ETA: 0s - loss: 1.0843 - acc: 0.3794184/203 [==========================>...] - ETA: 0s - loss: 1.0898 - acc: 0.3670190/203 [===========================>..] - ETA: 0s - loss: 1.0950 - acc: 0.3554196/203 [===========================>..] - ETA: 0s - loss: 1.0999 - acc: 0.3445202/203 [============================>.] - ETA: 0s - loss: 1.1045 - acc: 0.3343203/203 [==============================] - ETA: 0s - loss: 1.1048 - acc: 0.3336203/203 [==============================] - 3s 9ms/step - loss: 1.1048 - acc: 0.3336
