Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 1000, 128)         1280000   
_________________________________________________________________
conv1d (Conv1D)              (None, 994, 32)           28704     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 198, 32)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 192, 32)           7200      
_________________________________________________________________
global_max_pooling1d (Global (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 3)                 99        
=================================================================
Total params: 1,316,003
Trainable params: 1,316,003
Non-trainable params: 0
_________________________________________________________________

Model summary:  None
Applying model on test data, type:  UNIVERSE
X train shape:  (20120, 1000)
Y train shape:  (20120,)
X val shape:  (3772, 1000)
Y val shape:  (3772,)
X test shape:  (6618, 1000)
Y test shape:  (6618,)
  1/158 [..............................] - ETA: 4:42 - loss: 0.0088 - acc: 1.0000  3/158 [..............................] - ETA: 4s - loss: 0.0123 - acc: 0.9948    5/158 [..............................] - ETA: 4s - loss: 0.0174 - acc: 0.9953  7/158 [>.............................] - ETA: 4s - loss: 0.0148 - acc: 0.9967  9/158 [>.............................] - ETA: 4s - loss: 0.0140 - acc: 0.9965 11/158 [=>............................] - ETA: 4s - loss: 0.0123 - acc: 0.9972 13/158 [=>............................] - ETA: 4s - loss: 0.0109 - acc: 0.9976 15/158 [=>............................] - ETA: 4s - loss: 0.0122 - acc: 0.9974 17/158 [==>...........................] - ETA: 4s - loss: 0.0126 - acc: 0.9972 19/158 [==>...........................] - ETA: 4s - loss: 0.0142 - acc: 0.9971 21/158 [==>...........................] - ETA: 3s - loss: 0.0133 - acc: 0.9974 23/158 [===>..........................] - ETA: 3s - loss: 0.0128 - acc: 0.9973 25/158 [===>..........................] - ETA: 3s - loss: 0.0122 - acc: 0.9975 27/158 [====>.........................] - ETA: 3s - loss: 0.0135 - acc: 0.9971 29/158 [====>.........................] - ETA: 3s - loss: 0.0143 - acc: 0.9970 31/158 [====>.........................] - ETA: 3s - loss: 0.0136 - acc: 0.9972 33/158 [=====>........................] - ETA: 3s - loss: 0.0138 - acc: 0.9972 35/158 [=====>........................] - ETA: 3s - loss: 0.0149 - acc: 0.9969 37/158 [======>.......................] - ETA: 3s - loss: 0.0154 - acc: 0.9966 39/158 [======>.......................] - ETA: 3s - loss: 0.0152 - acc: 0.9966 41/158 [======>.......................] - ETA: 3s - loss: 0.0157 - acc: 0.9966 43/158 [=======>......................] - ETA: 3s - loss: 0.0156 - acc: 0.9965 45/158 [=======>......................] - ETA: 3s - loss: 0.0155 - acc: 0.9965 47/158 [=======>......................] - ETA: 3s - loss: 0.0156 - acc: 0.9965 49/158 [========>.....................] - ETA: 3s - loss: 0.0152 - acc: 0.9965 51/158 [========>.....................] - ETA: 3s - loss: 0.0156 - acc: 0.9965 53/158 [=========>....................] - ETA: 3s - loss: 0.0152 - acc: 0.9966 55/158 [=========>....................] - ETA: 2s - loss: 0.0159 - acc: 0.9963 57/158 [=========>....................] - ETA: 2s - loss: 0.0161 - acc: 0.9963 59/158 [==========>...................] - ETA: 2s - loss: 0.0157 - acc: 0.9964 61/158 [==========>...................] - ETA: 2s - loss: 0.0159 - acc: 0.9964 63/158 [==========>...................] - ETA: 2s - loss: 0.0155 - acc: 0.9965 65/158 [===========>..................] - ETA: 2s - loss: 0.0157 - acc: 0.9965 67/158 [===========>..................] - ETA: 2s - loss: 0.0157 - acc: 0.9964 69/158 [============>.................] - ETA: 2s - loss: 0.0154 - acc: 0.9965 71/158 [============>.................] - ETA: 2s - loss: 0.0151 - acc: 0.9966 73/158 [============>.................] - ETA: 2s - loss: 0.0156 - acc: 0.9966 75/158 [=============>................] - ETA: 2s - loss: 0.0156 - acc: 0.9966 77/158 [=============>................] - ETA: 2s - loss: 0.0153 - acc: 0.9967 79/158 [==============>...............] - ETA: 2s - loss: 0.0160 - acc: 0.9965 81/158 [==============>...............] - ETA: 2s - loss: 0.0160 - acc: 0.9965 83/158 [==============>...............] - ETA: 2s - loss: 0.0157 - acc: 0.9966 85/158 [===============>..............] - ETA: 2s - loss: 0.0154 - acc: 0.9967 87/158 [===============>..............] - ETA: 2s - loss: 0.0154 - acc: 0.9967 89/158 [===============>..............] - ETA: 2s - loss: 0.0156 - acc: 0.9967 91/158 [================>.............] - ETA: 1s - loss: 0.0154 - acc: 0.9967 93/158 [================>.............] - ETA: 1s - loss: 0.0152 - acc: 0.9968 95/158 [=================>............] - ETA: 1s - loss: 0.0151 - acc: 0.9968 97/158 [=================>............] - ETA: 1s - loss: 0.0157 - acc: 0.9967 99/158 [=================>............] - ETA: 1s - loss: 0.0154 - acc: 0.9968101/158 [==================>...........] - ETA: 1s - loss: 0.0157 - acc: 0.9967103/158 [==================>...........] - ETA: 1s - loss: 0.0155 - acc: 0.9967105/158 [==================>...........] - ETA: 1s - loss: 0.0153 - acc: 0.9968107/158 [===================>..........] - ETA: 1s - loss: 0.0152 - acc: 0.9969109/158 [===================>..........] - ETA: 1s - loss: 0.0152 - acc: 0.9968111/158 [====================>.........] - ETA: 1s - loss: 0.0151 - acc: 0.9968113/158 [====================>.........] - ETA: 1s - loss: 0.0150 - acc: 0.9968115/158 [====================>.........] - ETA: 1s - loss: 0.0151 - acc: 0.9968117/158 [=====================>........] - ETA: 1s - loss: 0.0152 - acc: 0.9967119/158 [=====================>........] - ETA: 1s - loss: 0.0152 - acc: 0.9967121/158 [=====================>........] - ETA: 1s - loss: 0.0150 - acc: 0.9967123/158 [======================>.......] - ETA: 1s - loss: 0.0152 - acc: 0.9967125/158 [======================>.......] - ETA: 0s - loss: 0.0150 - acc: 0.9967127/158 [=======================>......] - ETA: 0s - loss: 0.0148 - acc: 0.9968129/158 [=======================>......] - ETA: 0s - loss: 0.0148 - acc: 0.9968131/158 [=======================>......] - ETA: 0s - loss: 0.0146 - acc: 0.9968133/158 [========================>.....] - ETA: 0s - loss: 0.0145 - acc: 0.9969135/158 [========================>.....] - ETA: 0s - loss: 0.0147 - acc: 0.9969137/158 [=========================>....] - ETA: 0s - loss: 0.0148 - acc: 0.9969139/158 [=========================>....] - ETA: 0s - loss: 0.0147 - acc: 0.9969141/158 [=========================>....] - ETA: 0s - loss: 0.0151 - acc: 0.9968143/158 [==========================>...] - ETA: 0s - loss: 0.0152 - acc: 0.9968145/158 [==========================>...] - ETA: 0s - loss: 0.0151 - acc: 0.9968147/158 [==========================>...] - ETA: 0s - loss: 0.0152 - acc: 0.9968149/158 [===========================>..] - ETA: 0s - loss: 0.0151 - acc: 0.9968151/158 [===========================>..] - ETA: 0s - loss: 0.0150 - acc: 0.9968153/158 [============================>.] - ETA: 0s - loss: 0.0149 - acc: 0.9968155/158 [============================>.] - ETA: 0s - loss: 0.0148 - acc: 0.9969157/158 [============================>.] - ETA: 0s - loss: 0.0147 - acc: 0.9969158/158 [==============================] - ETA: 0s - loss: 0.0147 - acc: 0.9969158/158 [==============================] - 7s 30ms/step - loss: 0.0147 - acc: 0.9969
 1/30 [>.............................] - ETA: 1s - loss: 0.1231 - acc: 0.9609 3/30 [==>...........................] - ETA: 0s - loss: 0.1590 - acc: 0.9505 5/30 [====>.........................] - ETA: 0s - loss: 0.1683 - acc: 0.9500 7/30 [======>.......................] - ETA: 0s - loss: 0.1582 - acc: 0.9509 9/30 [========>.....................] - ETA: 0s - loss: 0.1611 - acc: 0.952311/30 [==========>...................] - ETA: 0s - loss: 0.1520 - acc: 0.954513/30 [============>.................] - ETA: 0s - loss: 0.1546 - acc: 0.956715/30 [==============>...............] - ETA: 0s - loss: 0.1524 - acc: 0.957817/30 [================>.............] - ETA: 0s - loss: 0.1502 - acc: 0.959119/30 [==================>...........] - ETA: 0s - loss: 0.1548 - acc: 0.959321/30 [====================>.........] - ETA: 0s - loss: 0.1544 - acc: 0.959423/30 [======================>.......] - ETA: 0s - loss: 0.1522 - acc: 0.958625/30 [========================>.....] - ETA: 0s - loss: 0.1557 - acc: 0.957527/30 [==========================>...] - ETA: 0s - loss: 0.1618 - acc: 0.956329/30 [============================>.] - ETA: 0s - loss: 0.1657 - acc: 0.955830/30 [==============================] - ETA: 0s - loss: 0.1646 - acc: 0.955730/30 [==============================] - 1s 36ms/step - loss: 0.1646 - acc: 0.9557
 1/52 [..............................] - ETA: 2s - loss: 0.0170 - acc: 0.9922 3/52 [>.............................] - ETA: 1s - loss: 0.0931 - acc: 0.9661 5/52 [=>............................] - ETA: 1s - loss: 0.1097 - acc: 0.9594 7/52 [===>..........................] - ETA: 1s - loss: 0.0986 - acc: 0.9609 9/52 [====>.........................] - ETA: 1s - loss: 0.1221 - acc: 0.955711/52 [=====>........................] - ETA: 1s - loss: 0.1687 - acc: 0.948913/52 [======>.......................] - ETA: 1s - loss: 0.2160 - acc: 0.941715/52 [=======>......................] - ETA: 1s - loss: 0.2603 - acc: 0.934417/52 [========>.....................] - ETA: 0s - loss: 0.2689 - acc: 0.933419/52 [=========>....................] - ETA: 0s - loss: 0.3228 - acc: 0.917421/52 [===========>..................] - ETA: 0s - loss: 0.3420 - acc: 0.911123/52 [============>.................] - ETA: 0s - loss: 0.4260 - acc: 0.897125/52 [=============>................] - ETA: 0s - loss: 0.4390 - acc: 0.890327/52 [==============>...............] - ETA: 0s - loss: 0.4385 - acc: 0.890929/52 [===============>..............] - ETA: 0s - loss: 0.4258 - acc: 0.892031/52 [================>.............] - ETA: 0s - loss: 0.4180 - acc: 0.892433/52 [==================>...........] - ETA: 0s - loss: 0.4644 - acc: 0.878835/52 [===================>..........] - ETA: 0s - loss: 0.5444 - acc: 0.857837/52 [====================>.........] - ETA: 0s - loss: 0.5828 - acc: 0.845439/52 [=====================>........] - ETA: 0s - loss: 0.6907 - acc: 0.825141/52 [======================>.......] - ETA: 0s - loss: 0.7206 - acc: 0.814643/52 [=======================>......] - ETA: 0s - loss: 0.7448 - acc: 0.807845/52 [========================>.....] - ETA: 0s - loss: 0.8060 - acc: 0.798647/52 [==========================>...] - ETA: 0s - loss: 0.8781 - acc: 0.787449/52 [===========================>..] - ETA: 0s - loss: 0.9350 - acc: 0.778951/52 [============================>.] - ETA: 0s - loss: 0.9796 - acc: 0.770552/52 [==============================] - ETA: 0s - loss: 0.9926 - acc: 0.768852/52 [==============================] - 2s 35ms/step - loss: 0.9926 - acc: 0.7688
MODEL PERFORMANCE

 Training accuracy:  0.9968687891960144 Training loss:  0.014707440510392189

 Validation accuracy:  0.9557263851165771 Validation loss:  0.16462048888206482

 Test accuracy:  0.9926069378852844 Test loss:  0.768812358379364
